#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
random_password.api_auth_token: Refreshing state... [id=none]
data.archive_file.lambda_package: Reading...
aws_api_gateway_rest_api.monolith: Refreshing state... [id=aqp4ec4m71]
aws_secretsmanager_secret.api_auth_token: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:757214766189:secret:user-account-service-test-api-token-9IRyjV]
data.aws_iam_policy_document.lambda_logging: Reading...
data.aws_iam_policy_document.lambda: Reading...
data.aws_iam_policy_document.lambda_logging: Read complete after 0s [id=4224822605]
data.aws_iam_policy_document.lambda: Read complete after 0s [id=2690255455]
aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::757214766189:policy/user-account-service-test-lambda-logging]
aws_iam_role.lambda: Refreshing state... [id=user-account-service-test-lambda]
aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=user-account-service-test-lambda-20230611185514577700000001]
aws_secretsmanager_secret_version.api_auth_token: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:757214766189:secret:user-account-service-test-api-token-9IRyjV|CE8B36E7-237F-4890-836A-1673C71B5443]
aws_api_gateway_resource.root_proxy: Refreshing state... [id=tx5vax]
data.archive_file.lambda_package: Read complete after 3s [id=3d4822103c7f347d219b6744522d47249450381e]
aws_lambda_function.monolith: Refreshing state... [id=user-account-service-test-monolith]
aws_api_gateway_method.root_proxy_options: Refreshing state... [id=agm-aqp4ec4m71-tx5vax-OPTIONS]
aws_api_gateway_method.root_proxy_any: Refreshing state... [id=agm-aqp4ec4m71-tx5vax-ANY]
aws_api_gateway_method_response.root_proxy_any_200: Refreshing state... [id=agmr-aqp4ec4m71-tx5vax-ANY-200]
aws_api_gateway_method_response.root_proxy_options_200: Refreshing state... [id=agmr-aqp4ec4m71-tx5vax-OPTIONS-200]
aws_api_gateway_integration.root_proxy_options_mock: Refreshing state... [id=agi-aqp4ec4m71-tx5vax-OPTIONS]
aws_api_gateway_integration_response.root_proxy_options_200: Refreshing state... [id=agir-aqp4ec4m71-tx5vax-OPTIONS-200]
aws_api_gateway_integration_response.root_proxy_options_mock: Refreshing state... [id=agir-aqp4ec4m71-tx5vax-OPTIONS-200]
aws_lambda_permission.api_gateway_invocation: Refreshing state... [id=AllowExecutionFromApiGateway]
aws_api_gateway_integration.root_proxy: Refreshing state... [id=agi-aqp4ec4m71-tx5vax-ANY]
aws_api_gateway_deployment.monolith: Refreshing state... [id=j75waa]
aws_api_gateway_integration_response.root_proxy_any_200: Refreshing state... [id=agir-aqp4ec4m71-tx5vax-ANY-200]
aws_api_gateway_stage.monolith: Refreshing state... [id=ags-aqp4ec4m71-v1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.monolith will be updated in-place
  ~ resource "aws_lambda_function" "monolith" {
        id                             = "user-account-service-test-monolith"
      ~ last_modified                  = "2023-06-24T00:49:21.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:757214766189:function:user-account-service-test-monolith:22" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:757214766189:function:user-account-service-test-monolith:22/invocations" -> (known after apply)
      ~ source_code_hash               = "SU6GgYnr/+bZuJLUUbi36XlH2WSCPHVNnwezD9CaCZY=" -> "W6IFUQRv65daI1bkJdueARZWDJTDBWhSNjtkeuXzlZU="
        tags                           = {}
      ~ version                        = "22" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @renovate[bot], Action: `pull_request`, Workflow: `Deployment`*